RSN/src/ExchangePlans/ПередачаМастерданных/ПередачаМастерданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="d5f8ebba-ca21-4ab8-b273-ce0d175cddab">
  <name>ПередачаМастерданных</name>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучателиОповещений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПравилаРегистрации</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданныхИнформационныхБаз</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолеПоиска</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

RSN/src/ExchangePlans/ПередачаМастерданных/Forms/ФормаУзла/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы    

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.Код = Объект.Наименование;
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиОповещенийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПолучателиОповещенийЗавершениеВвода", ЭтотОбъект);
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, Объект.ПолучателиОповещений, "Укажите получателей оповещений через точку с запятой");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ЗаполнитьЗначениеОрганизациейИБ(Команда)   
	
	Если Не ЗначениеЗаполнено(Объект.ИнформационнаяБаза) Тогда  
		ТекстСообщения = НСтр("ru = 'Не выбрана информационная база.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.ИнформационнаяБаза");
		Возврат;
	КонецЕсли;
	
	ИДОрганизации = ПолучитьГУИДОрганизации(Объект.ИнформационнаяБаза); 
	Если Не ЗначениеЗаполнено(ИДОрганизации) Тогда
		ТекстСообщения = НСтр("ru = 'Не указана организация информационной базы.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.ИнформационнаяБаза");
		Возврат;	
	КонецЕсли;
	
	ТекДанные = Элементы.ПравилаРегистрации.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТекДанные.Значение = ИДОрганизации; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьГУИДОрганизации(ИнформационнаяБаза)
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИнформационнаяБаза, "Организация");
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Организация.УникальныйИдентификатор(); 
	
КонецФункции

&НаКлиенте
Процедура ПолучателиОповещенийЗавершениеВвода(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Объект.ПолучателиОповещений = СтрЗаменить(ВведенныйТекст, " ", "");
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
